data/WS-Addressing/ws-addressing-12.xml

<?xml version="1.0" ?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><To xmlns="http://www.w3.org/2005/08/addressing">http://localhost:4040/jaxwsa-w3c_s11/cr</To><MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:7c813998-73f1-47b8-b28b-693501b5ce00</MessageID><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address><ReferenceParameters><ck:CustomerKey xmlns:ck="http://example.org/customer">Key#123456789</ck:CustomerKey></ReferenceParameters></ReplyTo><Action xmlns="http://www.w3.org/2005/08/addressing">http://example.org/action/echoIn</Action></S:Header><S:Body><ns2:echoIn xmlns:ns2="http://example.org/echo" xmlns="http://example.org/notify">test1132</ns2:echoIn></S:Body></S:Envelope>